cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'fzf'
brew 'go'
brew 'grc'
brew 'heroku'
brew 'htop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kubectl'
brew 'libgit2'
brew 'openssl'
brew 'mongodb@3.0'
brew 'nativefier'
brew 'node'
brew 'nvm'
brew 'rabbitmq'
brew 'readline'
brew 'postgresql'
brew 'roundup'
brew 'sift'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'google-backup-and-sync'
cask 'bartender'
cask 'catch'
cask 'cloudapp'
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'caskroom/versions/google-chrome-canary'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'magicprefs'
cask 'ngrok'
cask 'numi'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'studio-3t'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
