cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'shivammathur/php'
tap 'tclass/cloud_sql_proxy'
tap 'johanhaleby/kubetail'

brew 'ack'
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'bison'
brew 'cloud_sql_proxy'
brew 'cmake'
brew 'coreutils'
brew 'diskus'
brew 'docker'
brew 'duti'
brew 'fd'
brew 'ffmpeg'
brew 'fswatch'
brew 'fwup'
brew 'fzf'
brew 'github-release'
brew 'go'
brew 'grc'
brew 'hashicorp/tap/terraform-ls'
brew 'http-server'
brew 'htop'
brew 'homebrew/cask-fonts/font-fira-code-nerd-font'
brew 'homebrew/cask-fonts/font-fira-mono-nerd-font'
brew 'imagemagick'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'kubetail'
brew 'kustomize'
brew 'libgit2'
brew 'mas'
brew 'nativefier'
brew 'neofetch'
brew 'ngrok'
brew 'openssl'
brew 'pass'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'readline'
brew 'sift'
brew 'shivammathur/php/php@8.0'
brew 'spaceman-diff'
brew 'spark'
brew 'squashfs'
brew 'xz'

cask 'ableton-live-suite'
cask 'alfred'
cask 'backblaze'
cask 'bartender'
cask 'cloudapp'
cask 'dash'
cask 'docker'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-cloud-sdk'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'keybase'
cask 'lulu'
cask 'meetingbar'
cask 'multitouch'
cask 'notion'
cask 'numi'
cask 'phoenix'
cask 'sequel-ace'
cask 'slack'
cask 'signal'
cask 'splice'
cask 'transmission'
cask 'toggl-track'
cask 'vlc'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'zoomus'

mas "Irvue", id: 1039633667
mas "Postico", id: 1031280567
