tap "zdk/tools"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern, maintained replacement for ls
brew "eza"
# Command-line tools for fly.io services
brew "flyctl"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# NCurses Disk Usage
brew "ncdu"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Cross-shell prompt for astronauts
brew "starship"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Low-fat command output for LLM environments
brew "zdk/tools/lowfat", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Utility to add Dynamic Island like features to notch area
cask "alcove"
# Chromium based browser
cask "arc"
# Data backup and storage service
cask "backblaze"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Convert potentially dangerous PDFs or Office documents into safe PDFs
cask "dangerzone"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Client for the Google Drive storage service
cask "google-drive"
# Discover, download, and run local LLMs
cask "lm-studio"
# Screen and video recording software
cask "loom"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# App to write, plan, collaborate, and get organised
cask "notion"
# Replacement for Docker Desktop
cask "orbstack"
# Monitors computer mic and webcam
cask "oversight"
# GUI client for PostgreSQL databases
cask "postico"
# Control your tools with a few keystrokes
cask "raycast"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "anthropic.claude-code"
vscode "remoteoss.dexter-lsp"
vscode "tekumara.typos-vscode"
